tap "antoniorodr/memo"
tap "authzed/tap"
tap "steipete/tap"
tap "yugabyte/yugabytedb"
brew "air"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gnupg"
brew "go"
brew "graphviz"
brew "gron"
brew "htop"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kcat"
brew "kubelogin"
brew "kubernetes-cli"
brew "libpq", link: true
brew "neovim"
brew "node"
brew "pinentry-mac"
brew "pkgconf"
brew "protoc-gen-go"
brew "ripgrep"
brew "rustup"
brew "stern"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "uv"
brew "watch"
brew "yq"
brew "zoxide"
brew "antoniorodr/memo/memo"
brew "authzed/tap/zed"
brew "steipete/tap/gifgrep"
brew "steipete/tap/summarize"
brew "yugabyte/yugabytedb/yugabytedb"
cask "appcleaner"
cask "boop"
cask "clickhouse"
cask "dbeaver-community"
cask "devutils"
cask "docker-desktop"
cask "firefox"
cask "font-jetbrains-mono"
cask "lm-studio"
cask "meld"
cask "monitorcontrol"
cask "rectangle"
cask "spotify"
cask "stats"
cask "stolendata-mpv"
cask "syncthing-app"
cask "transmission-remote-gui"
cask "usage-app"
cask "visual-studio-code"
cask "vlc"
cask "warp"
vscode "a-h.templ"
vscode "aaron-bond.better-comments"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "apilinter.api-linter"
vscode "authzed.spicedb-vscode"
vscode "azemoh.one-monokai"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "circleci.circleci"
vscode "codeandstuff.package-json-upgrade"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "drblury.protobuf-vsc"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "henriiik.docker-linter"
vscode "honnamkuan.golang-snippets"
vscode "huang12zheng.protobuf-helper"
vscode "jebbs.plantuml"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mammothb.gnuplot"
vscode "mesonbuild.mesonbuild"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "orta.vscode-jest"
vscode "perkovec.emoji"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-protolint"
vscode "plex.vscode-regolint"
vscode "premparihar.gotestexplorer"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "slint.slint"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tsandall.opa"
vscode "tscpp.proto-lang"
vscode "twxs.cmake"
vscode "typescriptteam.native-preview"
vscode "ultram4rine.sqltools-clickhouse-driver"
vscode "upstash.context7-mcp"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vscjava.vscode-java-upgrade"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
go "github.com/air-verse/air"
go "github.com/googleapis/api-linter/cmd/api-linter"
go "github.com/knipferrc/branch-cleaner"
go "github.com/bufbuild/buf/cmd/buf"
go "github.com/square/certstrap"
go "github.com/runreveal/chdump/cmd/chdump"
go "github.com/CircleCI-Public/circleci-cli"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/cmd/deadcode"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/antonmedv/fx"
go "github.com/junegunn/fzf"
go "github.com/bruceadowns/gfdupes"
go "github.com/zcong1993/gist"
go "github.com/ramya-rao-a/go-outline"
go "github.com/bykof/go-plantuml"
go "github.com/nsf/gocode"
go "mvdan.cc/gofumpt"
go "github.com/incu6us/goimports-reviser/v3"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "golang.org/x/lint/golint"
go "github.com/fatih/gomodifytags"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/jfeliu007/goplantuml/cmd/goplantuml"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "github.com/hherman1/gq"
go "github.com/grpc-ecosystem/grpc-health-probe"
go "github.com/fullstorydev/grpcui/cmd/grpcui"
go "github.com/fullstorydev/grpcurl/cmd/grpcurl"
go "github.com/digitalocean/gta/cmd/gta"
go "github.com/gohugoio/hugo"
go "github.com/josharian/impl"
go "github.com/ipfs/kubo/cmd/ipfs"
go "github.com/derailed/k9s"
go "github.com/bitnami-labs/sealed-secrets/cmd/kubeseal"
go "github.com/jesseduffield/lazydocker"
go "github.com/jesseduffield/lazygit"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/vektra/mockery/v2"
go "go.uber.org/mock/mockgen"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/infobloxopen/protoc-gen-gorm"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-openapiv2"
go "github.com/yoheimuta/protolint/cmd/protolint"
go "github.com/boyter/scc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/stern/stern"
go "github.com/yorukot/superfile"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/a-h/templ/cmd/templ"
go "github.com/a8m/tree/cmd/tree"
